---
kind: method
id: M:Autodesk.Revit.DB.PlanCircuitSet.Insert(Autodesk.Revit.DB.PlanCircuit)
source: html/a0abc6d3-dac7-09f6-e13e-7bf43e17aa6c.htm
---
# Autodesk.Revit.DB.PlanCircuitSet.Insert Method

Insert the specified item into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	PlanCircuit item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PlanCircuit`) - The item to be inserted into the set.

## Returns
Returns whether the item was inserted into the set.